//ТРПС Лаба 1
//09.02.2018
//
//Мотичев Михаил ИУ6-42
//Вариант 12
//Задача 3
//Даны М записей вида: Код группы, ФИО, Дата рождения.
//Структура: таблица; Поиск: двоичный; Упорядочение: Вставкой; Корректировка: удаление маркир.

Const M = 10; //Здесь можно менять количество записей для определения сложности/времени

Type student = record
  kod : integer;
  fio : string[80];
  date : string[10];
  flag : boolean;
end;

var
  arr : array [1..M] of student;

  kod : array[100000..200000] of boolean;

  fio : array[1..8] of string = ('Вишняков Вилен Семенович','Голубев Терентий Евгеньевич',
  'Архипов Архип Никитевич','Дьячков Назарий Николаевич','Рыбаков Роман Павлович',
  'Крюков Клемент Еремеевич','Жданов Гаянэ Проклович','Королёв Мартин Дамирович');

  date : array [1..8] of string = ('10.02.2001','09.12.1997','01.04.1977',
  '23.09.1899','20.05.1991','03.11.1987','07.06.1967','13.07.1999');

  i : integer;
begin

//------------------------------Заполнение массива------------------------------
randomize;
for i:=1 to M do begin
  //Заполняем код
  repeat
    arr[i].kod := random(100001)+100000;
  until kod[arr[i].kod] = false;
  kod[arr[i].kod]:= true;
  //Заполняем ФИО
  arr[i].fio := fio[random(8)+1];
  arr[i].date := date[random(8)+1];
end;
//-------------------------------Конец заполнения-------------------------------



end.
